using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/// Леонид Васильев
/// 3. Решить задачу с логинами из предыдущего урока, только логины и пароли считать из файла в массив. Создайте структуру Account, содержащую Login и Password.
/// Урок 2
/// 4. Реализовать метод проверки логина и пароля. На вход подается логин и пароль. 
/// На выходе истина, если прошел авторизацию, и ложь, если не прошел (Логин: root, Password: GeekBrains).
/// Используя метод проверки логина и пароля, написать программу: пользователь вводит логин и пароль, программа пропускает его дальше или не пропускает. 
/// С помощью цикла do while ограничить ввод пароля тремя попытками.

namespace L4Task3
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
