using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/// Леонид Васильев
/// 4. *а) Реализовать класс для работы с двумерным массивом. 
/// Реализовать конструктор, заполняющий массив случайными числами. 
/// Создать методы, которые возвращают сумму всех элементов массива, 
/// сумму всех элементов массива больше заданного, 
/// свойство, возвращающее минимальный элемент массива, 
/// свойство, возвращающее максимальный элемент массива, 
/// метод, возвращающий номер максимального элемента массива (через параметры, используя модификатор ref или out)
/// *б) Добавить конструктор и методы, которые загружают данные из файла и записывают данные в файл.
/// Дополнительные задачи
/// в) Обработать возможные исключительные ситуации при работе с файлами.

namespace L4Task4
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
