using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/// Леонид Васильев
/// 3. *Описать класс дробей - рациональных чисел, являющихся отношением двух целых чисел. 
/// Предусмотреть методы сложения, вычитания, умножения и деления дробей. Написать программу, демонстрирующую все разработанные элементы класса.
/// **Добавить проверку, чтобы знаменатель не равнялся 0. Выбрасывать исключение
/// ArgumentException("Знаменатель не может быть равен 0");
/// Добавить упрощение дробей.

namespace L3Task3
{
   

    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
