using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/// Леонид Васильев
/// 3. *Для двух строк написать метод, определяющий, является ли одна строка перестановкой (символов) другой. Регистр можно не учитывать:
/// а) с использованием методов C#;
/// б) *разработав собственный алгоритм.
/// Например:
/// badc являются перестановкой abcd.
/// 
/// Замечание:
/// Не понял какие методы С# подразумеваются в пункте А. 
/// Не нашел стандартной функции, которая делает такую проверку, а все остальные решения подподают под пункт Б.

namespace L5Task3
{
    class Program
    {

        static void Main(string[] args)
        {
            

        }
    }
}
