using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

/// Леонид Васильев
/// 2. а) Дописать класс для работы с одномерным массивом. 
/// Реализовать конструктор, создающий массив заданной размерности и заполняющий массив числами от начального значения с заданным шагом. 
/// Создать свойство Sum, которые возвращают сумму элементов массива, 
/// метод Inverse, меняющий знаки у всех элементов массива, 
/// метод Multi, умножающий каждый элемент массива на определенное число, 
/// свойство MaxCount, возвращающее количество максимальных элементов. 
/// В Main продемонстрировать работу класса.
/// б)Добавить конструктор и методы, которые загружают данные из файла и записывают данные в файл.


namespace L4Task2
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
